In [4]:
import sqlite3

In [82]:
# create database

In [81]:
dbcon=sqlite3.connect('mystudent_database.db')

In [6]:
cur=dbcon.cursor()

In [7]:
cur.execute("create table student(id int primary key , name text , marks int)")

In [8]:
cur.execute("insert into student (id,name,marks) values (1,'Riya',90),(2,'Riku',88),(3,'Kity',70),(4,'Jack',65),(5,'John',68),(6,'Koyel',77),(7,'Tomy',75),(8,'Tithi',86)")

In [9]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'Riya', 90)
(2, 'Riku', 88)
(3, 'Kity', 70)
(4, 'Jack', 65)
(5, 'John', 68)
(6, 'Koyel', 77)
(7, 'Tomy', 75)
(8, 'Tithi', 86)

In [10]:
results=cur.execute("SELECT DISTINCT marks from student")
for i in results:
    print(i)

(90,)
(88,)
(70,)
(65,)
(68,)
(77,)
(75,)
(86,)

In [11]:
results=cur.execute('select max(marks) from student where marks<(select max(marks) from student)')
for i in results:
    print(i)

(88,)

In [12]:
results=cur.execute("select * from student where name='Riku'")
for i in results:
    print(i)

(2, 'Riku', 88)

In [13]:
results=cur.execute("select marks from student where marks is NULL")
results.fetchall()

[]

In [14]:
results=cur.execute("SELECT marks from student WHERE marks IS NOT NULL")
results.fetchall()

[(90,), (88,), (70,), (65,), (68,), (77,), (75,), (86,)]

In [16]:
results=cur.execute("select name from student order by name asc")
results.fetchall()

[('Jack',),
 ('John',),
 ('Kity',),
 ('Koyel',),
 ('Riku',),
 ('Riya',),
 ('Tithi',),
 ('Tomy',)]

In [17]:
results=cur.execute("select name from student order by name desc")
results.fetchall()

[('Tomy',),
 ('Tithi',),
 ('Riya',),
 ('Riku',),
 ('Koyel',),
 ('Kity',),
 ('John',),
 ('Jack',)]

In [18]:
results=cur.execute("select * from student limit 5 ")
for i in results:
    print(i)

(1, 'Riya', 90)
(2, 'Riku', 88)
(3, 'Kity', 70)
(4, 'Jack', 65)
(5, 'John', 68)

In [21]:
results=cur.execute("select * from student where id=1 or name ='Riku'")
results.fetchall()

[(1, 'Riya', 90), (2, 'Riku', 88)]

In [20]:
results=cur.execute("select name from student where id in (1,2,3) ")
for i in results:
    print(i)

('Riya',)
('Riku',)
('Kity',)

In [22]:
results=cur.execute("select * from student where id = 1 AND name = 'Riya'")
for i in results:
    print(i)

(1, 'Riya', 90)

In [27]:
results=cur.execute("SELECT * from student WHERE name IS  NULL ")
results.fetchall()

[]

In [23]:
results=cur.execute("select * from student where name is not 'null'")
for i in results:
    print(i)

(1, 'Riya', 90)
(2, 'Riku', 88)
(3, 'Kity', 70)
(4, 'Jack', 65)
(5, 'John', 68)
(6, 'Koyel', 77)
(7, 'Tomy', 75)
(8, 'Tithi', 86)

In [28]:
results=cur.execute("select sum(marks) from student")
results.fetchall()

[(619,)]

In [29]:
results=cur.execute("select avg(marks) from student")
results.fetchone()

(77.375,)

In [30]:
results=cur.execute("select count(id) from student")
results.fetchone()

(8,)

In [31]:
results=cur.execute("select count(marks) from student")
results.fetchone()

(8,)

In [32]:
results=cur.execute("select count(name) from student")
results.fetchone()

(8,)

In [33]:
results=cur.execute("select * from student where name Like '_i_%' ")
for i in results:
    print(i)

(1, 'Riya', 90)
(2, 'Riku', 88)
(3, 'Kity', 70)
(8, 'Tithi', 86)

In [36]:
results=cur.execute("select * from student where name Like 'Ri__'")
for i in results:
    print(i)

(1, 'Riya', 90)
(2, 'Riku', 88)

In [37]:
results=cur.execute("select * from student where name Like '%s%' ")
for i in results:
    print(i)

In [39]:
results=cur.execute("select * from student where name Like '__ku%'  ")
for i in results:
    print(i)

(2, 'Riku', 88)

In [44]:
results=cur.execute("select name from student where name Like '___%i' ")
results.fetchall()

[('Tithi',)]

In [45]:
results=cur.execute('update student set marks=98 where id = 1')
results.fetchall()

[]

In [46]:
results=cur.execute("select * from student")

results.fetchall()

[(1, 'Riya', 98),
 (2, 'Riku', 88),
 (3, 'Kity', 70),
 (4, 'Jack', 65),
 (5, 'John', 68),
 (6, 'Koyel', 77),
 (7, 'Tomy', 75),
 (8, 'Tithi', 86)]

In [47]:
results=cur.execute("select name from student where marks between 80 and 90")
results.fetchall()

[('Riku',), ('Tithi',)]

SQL JOIN

Referential Integrity

In [48]:
import sqlite3

In [49]:
db=sqlite3.connect("student_course.db")

In [50]:
cur=db.cursor()

In [51]:
cur.execute("create table course (courseid int primary key , coursename text , duration int)")

In [55]:
cur.execute("create table student (rollno int primary key , studentname text , age int , courseid int, foreign key(courseid) references course(courseid))")

In [56]:
cur.execute("insert into course values (78,'data science',45),(56,'python',30),(29,'mysql',20),(22,'r language',15),(27,'machine learning',50)")

In [57]:
cur.execute("insert into student values(1,'riku',23,78),(2,'riya',26,56),(3,'tithi',24,29),(4,'titu',20,22),(5,'jack',28,27),(6,'john',30,56),(7,'popi',32,78)")

SQL QUERY

In [65]:
results=cur.execute("select * from course")
results.fetchall()

[(78, 'data science', 45),
 (56, 'python', 30),
 (29, 'mysql', 20),
 (22, 'r language', 15),
 (27, 'machine learning', 50)]

In [67]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'riku', 23, 78),
 (2, 'riya', 26, 56),
 (3, 'tithi', 24, 29),
 (4, 'titu', 20, 22),
 (5, 'jack', 28, 27),
 (6, 'john', 30, 56),
 (7, 'popi', 32, 78)]

In [68]:
# fetch out 2nd highest age

In [59]:
results=cur.execute("select max(age) from student where age<(select max(age) from student)")
results.fetchall()

[(30,)]

In [60]:
# fetch out max age

In [61]:
results=cur.execute("select max(age) from student")
results.fetchall()

[(32,)]

In [62]:
results=cur.execute("select age from student")
results.fetchall()

[(23,), (26,), (24,), (20,), (28,), (30,), (32,)]

In [63]:
# fetch out course id where course name is 'data science'

In [64]:
results=cur.execute("select courseid from course where coursename='data science'")
results.fetchall()

[(78,)]

In [69]:
# fetch out all student courseid where coursename is 'data science'

In [70]:
results=cur.execute("select * from student where courseid=(select courseid from course where coursename='data science')")
results.fetchall()

[(1, 'riku', 23, 78), (7, 'popi', 32, 78)]

In [71]:
# fetch out all student courseid where coursename is 'python'

In [72]:
results=cur.execute("select * from student where courseid=(select courseid from course where coursename='python')")
results.fetchall()

[(2, 'riya', 26, 56), (6, 'john', 30, 56)]

In [73]:
# fetch out studentname who taken addmission for python.

In [76]:
results=cur.execute("select studentname from student where courseid =(select courseid from course where coursename='python')")
results.fetchall()

[('riya',), ('john',)]

In [ ]:
# fetch out student age who taken addmission for python

In [77]:
results=cur.execute("select age from student where courseid=(select courseid from course where coursename ='python')")
results.fetchall()

[(26,), (30,)]

In [78]:
# fetch out student rollno who taken admission for python & data science

In [79]:
results=cur.execute("select rollno from student where courseid=(select courseid from course where coursename='python' )")
results.fetchall()

[(2,), (6,)]

In [80]:
results=cur.execute("select rollno from student where courseid=(select courseid from course where coursename='data science')")
results.fetchall()

[(1,), (7,)]

SQL JOIN

In [84]:
# Inner Join

In [88]:
sql="SELECT student.rollno,student.studentname,student.age,course.courseid,course.coursename FROM student INNER JOIN course ON student.courseid=course.courseid"
results=cur.execute(sql)
for row in results:
    print(row)

(1, 'riku', 23, 78, 'data science')
(2, 'riya', 26, 56, 'python')
(3, 'tithi', 24, 29, 'mysql')
(4, 'titu', 20, 22, 'r language')
(5, 'jack', 28, 27, 'machine learning')
(6, 'john', 30, 56, 'python')
(7, 'popi', 32, 78, 'data science')

In [89]:
# Left join

In [90]:
sql="SELECT student.rollno,student.studentname,student.age,course.courseid,course.coursename,student.age FROM student LEFT JOIN course ON student.courseid=course.courseid"
results=cur.execute(sql)
for row in results:
    print(row)

(1, 'riku', 23, 78, 'data science', 23)
(2, 'riya', 26, 56, 'python', 26)
(3, 'tithi', 24, 29, 'mysql', 24)
(4, 'titu', 20, 22, 'r language', 20)
(5, 'jack', 28, 27, 'machine learning', 28)
(6, 'john', 30, 56, 'python', 30)
(7, 'popi', 32, 78, 'data science', 32)